增加ASM的图形化表示
